app/views/gossips/edit.html.erb

                  <h4 class="h5 text-center">Gossip n°<%= @gossip.id%></h4>
                  <p class="text-center"><%= link_to @gossip.user.first_name , profile_path(:id => @gossip.user.first_name)%></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]