app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
---
        <div class="card-header">
          <p><%= link_to "Auteur: " + @gossips.user.first_name , profile_path(:id => @gossips.user.first_name)%></p>

DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 14]]
---

          <button type="button" class="btn btn-info" action="@gossips.delete" >Supprimer le potin