app/views/welcome/show.html.erb

        <div class="row mb-3">
      <% Gossip.all.each do |gossip|%>
---
SELECT "gossips".* FROM "gossips"

                  <a class="h5"
                    href="/profile/<%= gossip.user.first_name %>/"><b><%= gossip.user.first_name %></b></a><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]