app/controllers/cities_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "Clementborough"], ["LIMIT", 1]]
---
  def show
    @city = City.find_by(:name => params[:id])