app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def show
    @gossips = Gossip.find(params[:id])

SELECT "users".* FROM "users"
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "aelkjae"], ["content", "eflkhaelhze"], ["user_id", 16], ["created_at", "2020-08-04 19:01:40.924396"], ["updated_at", "2020-08-04 19:01:40.924396"]]
---
  def create
    id = User.all.sample.id
    @post = Gossip.new(title: params[:title], content:params[:content], user_id: id)

    if @post.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 1]]
---
  def destroy
  @gossips = Gossip.find(params[:id])
  @gossips.destroy

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @gossip = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "Surement encore un truc de CUL"], ["updated_at", "2020-08-05 22:19:26.467279"], ["id", 16]]
---
  def update
    @gossip = Gossip.find(params[:id])
    gossip_params =
    if @gossip.update(post_params)