app/views/cities/index.html.erb

SELECT "cities".* FROM "cities"
---
        <div class="row mb-3">
      <% City.all.each do |city|%>