app/views/cities/show.html.erb

SELECT "gossips".* FROM "gossips"
---
      </section>
      <% Gossip.all.each do |gossip|%>